In [1]:
import numpy as np
list=[1,2,3,4,5,6,9,10,12,55,60]

In [4]:
import numpy as np
Q1=np.percentile(list,25)
Q3=np.percentile(list,75)

In [5]:
IQR=Q3-Q1

In [6]:
IQR

7.5

In [9]:
low=Q1-1.5*IQR
upp=Q3+1.5*IQR

In [10]:
low,upp

(-7.75, 22.25)

In [8]:
Outliers=[]

In [11]:
for i in list:
    if((i>upp)or(i<low)):
        Outliers.append(i)

In [12]:
Outliers

[55, 60]

In [14]:
for i in list:
    if i not in Outliers:
        print(i)

1
2
3
4
5
6
9
10
12

In [16]:
#pandas duplicate values
import pandas as pd
data=pd.DataFrame({'team':['A','A','A','A','B','B','B','B'],
                    'points':[10,10,12,12,15,17,20,20],
                    'assists':[5,5,7,9,12,9,6,6]})

In [17]:
data

  team  points  assists
0    A      10        5
1    A      10        5
2    A      12        7
3    A      12        9
4    B      15       12
5    B      17        9
6    B      20        6
7    B      20        6

In [19]:
data[data.duplicated()]

  team  points  assists
1    A      10        5
7    B      20        6

In [20]:
data[data.duplicated(['team'])]

  team  points  assists
1    A      10        5
2    A      12        7
3    A      12        9
5    B      17        9
6    B      20        6
7    B      20        6

In [21]:
data[data.duplicated(['team','points'])]

  team  points  assists
1    A      10        5
3    A      12        9
7    B      20        6